# THIS FILE IS AUTOMATICALLY GENERATED
# Project: S:\Grader\PSoC Creator\projects\BLE_bidirectional_communication\BLE_bidirectional_communication\BLE_custom_service_characteristics.cydsn\BLE_custom_service_characteristics.cyprj
# Date: Sat, 18 Nov 2023 02:10:56 GMT
#set_units -time ns
create_clock -name {ADC_1_intClock(FFB)} -period 437.5 -waveform {0 218.75} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {Clock_1(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_1_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 21 43} [list]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 105 209} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for S:\Grader\PSoC Creator\projects\BLE_bidirectional_communication\BLE_bidirectional_communication\BLE_custom_service_characteristics.cydsn\TopDesign\TopDesign.cysch
# Project: S:\Grader\PSoC Creator\projects\BLE_bidirectional_communication\BLE_bidirectional_communication\BLE_custom_service_characteristics.cydsn\BLE_custom_service_characteristics.cyprj
# Date: Sat, 18 Nov 2023 02:10:51 GMT
